---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.CannotMoveMassing
source: html/c72dc4d9-ec06-b938-d43c-ab00e06581ef.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.CannotMoveMassing Property

Can't move whole Massing. Move the elements within the Massing instead.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMoveMassing { get; }
```